openfoam_setup/cavity/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;
libs            (sampling);
interpolationScheme cellPoint;
surfaceFormat   csv;

surfaces
(
    zPlane
    {
        type            plane;
        planeType       pointAndNormal;
        pointAndNormalDict
        {
            point           (0 0 0.05);
            normalVector    (0 0 1);
        }
        interpolate     true;
    }
);

fields          (p U);
